heaven1925/EEM_Protocol/Examples/0016_stm32cu_bcm_demo/Drivers/EEMProtocol/src/EEMProtocol.c
/*********************************START OF FILE********************************/
/*******************************************************************************
  * @file    EEMProtocol.h
  * @author	 Atakan ERTEKiN
  * @version V1.0.0
  * @date	 30.01.2023 - ...
  * @rev     V1.0.0
  * @brief	 Ege Elektromobil CAN Stack
********************************************************************************/

#include "EEMProtocol.h"
#include "EEMProtocol_Config.h"

#pragma message "EGE ELEKTROMOBIL CAN STACK BUILDING"

const	EEM_Protocol_opr_st		ops = 
{
	EEM_INIT		,
	EEM_TX			,
	EEM_RX
};

BCM_Module_st	BCM_MSG;
HVAC_Module_st	HVAC_MSG;
SCB_Module_st	SCB_MSG;
BMS_Module_st	BMS_MSG;
MS1_Module_st	MS1_MSG;
MS2_Module_st	MS2_MSG;
ISO_Module_st	ISO_MSG;
TLM_Module_st	TLM_MSG;
YSB_Module_st	YSB_MSG;


/*******************************************************************************
	 @func    :	
	 @param   : 
	 @return  : 
	 @date	  : 
	 @INFO		:	
********************************************************************************/
EEM_ERR_T EEM_INIT( EEM_Protocol_obj_st*  param )
{
	
	EEM_ERR_T result = EEM_EOK;

/* Ring Buffer Init Sequance */

	param->ringBuffer.head = 0;
	param->ringBuffer.tail = 0;
	param->ringBuffer.full = EEM_FALSE;

#if (defined(STM32F446xx) || defined(STM32F407xx) && defined(BXCAN_Protocol))
	
	
	
	
#elif (defined(STM32H750xx) && defined(FDCAN_Protocol))
	/*@NOTICE: All Configs for 42MHz CAN BASE CLOCK */

	param->fdHandle.hfdcanHandle.Instance 					= FDCAN1;
	param->fdHandle.hfdcanHandle.Init.FrameFormat 			= FDCAN_FRAME_CLASSIC;
	param->fdHandle.hfdcanHandle.Init.Mode 					= FDCAN_MODE_NORMAL;
	param->fdHandle.hfdcanHandle.Init.AutoRetransmission 	= ENABLE;
	param->fdHandle.hfdcanHandle.Init.TransmitPause 		= DISABLE;
	param->fdHandle.hfdcanHandle.Init.ProtocolException 	= DISABLE;
	param->fdHandle.hfdcanHandle.Init.NominalPrescaler 		= 12;
	param->fdHandle.hfdcanHandle.Init.NominalSyncJumpWidth 	= 1;
	param->fdHandle.hfdcanHandle.Init.NominalTimeSeg1 		= 11;
	param->fdHandle.hfdcanHandle.Init.NominalTimeSeg2 		= 2;
	param->fdHandle.hfdcanHandle.Init.DataPrescaler 		= 1;
	param->fdHandle.hfdcanHandle.Init.DataSyncJumpWidth 	= 1;
	param->fdHandle.hfdcanHandle.Init.DataTimeSeg1 			= 1;
	param->fdHandle.hfdcanHandle.Init.DataTimeSeg2 			= 1;
	param->fdHandle.hfdcanHandle.Init.MessageRAMOffset 		= 0;
	param->fdHandle.hfdcanHandle.Init.StdFiltersNbr 		= 0;
#if 	defined(BCM_MODULE)
	param->fdHandle.hfdcanHandle.Init.ExtFiltersNbr 		= 7;
#elif	defined( HVAC_MODULE )
/* HVAC module protocol has been written cpp language in order to arduino framework */
#elif	defined( SCB_MODULE )
/* Simple computer protocol has been written pyhton language */
#elif	defined( BMS_MODULE )
	param->fdHandle.hfdcanHandle.Init.ExtFiltersNbr 		= 2;
#elif	defined( MS1_MODULE )
	param->fdHandle.hfdcanHandle.Init.ExtFiltersNbr 		= 1;
#elif	defined( MS2_MODULE )
	param->fdHandle.hfdcanHandle.Init.ExtFiltersNbr 		= 1;
#elif	defined( ISO_MODULE )
	param->fdHandle.hfdcanHandle.Init.ExtFiltersNbr 		= 1;
#elif	defined( TLM_MODULE )
	param->fdHandle.hfdcanHandle.Init.ExtFiltersNbr 		= 1;
#else
	param->fdHandle.hfdcanHandle.Init.ExtFiltersNbr 		= 1; //@INFO: Tüm can paketleri alınır.
#endif
	param->fdHandle.hfdcanHandle.Init.RxFifo0ElmtsNbr 		= 1;
	param->fdHandle.hfdcanHandle.Init.RxFifo0ElmtSize 		= FDCAN_DATA_BYTES_8;
	param->fdHandle.hfdcanHandle.Init.RxFifo1ElmtsNbr 		= 0;
	param->fdHandle.hfdcanHandle.Init.RxFifo1ElmtSize 		= FDCAN_DATA_BYTES_8;
	param->fdHandle.hfdcanHandle.Init.RxBuffersNbr 			= 1;
	param->fdHandle.hfdcanHandle.Init.RxBufferSize 			= FDCAN_DATA_BYTES_8;
	param->fdHandle.hfdcanHandle.Init.TxEventsNbr 			= 0;
	param->fdHandle.hfdcanHandle.Init.TxBuffersNbr 			= 0;
	param->fdHandle.hfdcanHandle.Init.TxFifoQueueElmtsNbr 	= 24;
	param->fdHandle.hfdcanHandle.Init.TxFifoQueueMode 		= FDCAN_TX_FIFO_OPERATION;
	param->fdHandle.hfdcanHandle.Init.TxElmtSize 			= FDCAN_DATA_BYTES_8;
	if (HAL_FDCAN_Init(&param->fdHandle.hfdcanHandle) != HAL_OK)
	{
		return EEM_ERROR;
	}
#else

#if defined(SPI2CAN_Protocol)

	EEM_U8 ret;

	ret = CANSPI_Initialize();
	if( ret < 0 )
	{
		return EEM_ERROR;
	}

#else

#endif

#endif

	/* Message Identifier Handler */
	EEM_CAN_ID_st ID[SIZE_OF_MSG] = {0};

	ID[MSG01_INDEX].Pages.priority 		= PRIORITY_010 ;
	ID[MSG01_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG01_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG01_INDEX].Pages.messageID 	= MESSAGE01 ;
	ID[MSG01_INDEX].Pages.DA 			= BCM_NODE;
	ID[MSG01_INDEX].Pages.SA 			= HVAC_NODE ;
	HVAC_MSG.Message01_ID = ID[MSG01_INDEX].identifier ;

	ID[MSG02_INDEX].Pages.priority 		= PRIORITY_010 ;
	ID[MSG02_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG02_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG02_INDEX].Pages.messageID 	= MESSAGE02 ;
	ID[MSG02_INDEX].Pages.DA 			= BCM_NODE;
	ID[MSG02_INDEX].Pages.SA 			= HVAC_NODE ;
	HVAC_MSG.Message02_ID = ID[MSG02_INDEX].identifier ;

	ID[MSG03_INDEX].Pages.priority 		= PRIORITY_100 ;
	ID[MSG03_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG03_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG03_INDEX].Pages.messageID 	= MESSAGE03 ;
	ID[MSG03_INDEX].Pages.DA 			= TLM_NODE;
	ID[MSG03_INDEX].Pages.SA 			= BCM_NODE;
	BCM_MSG.Message03_ID = ID[MSG03_INDEX].identifier ;

	ID[MSG04_INDEX].Pages.priority 		= PRIORITY_100 ;
	ID[MSG04_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG04_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG04_INDEX].Pages.messageID 	= MESSAGE04 ;
	ID[MSG04_INDEX].Pages.DA 			= SCB_NODE;
	ID[MSG04_INDEX].Pages.SA 			= BCM_NODE;
	BCM_MSG.Message04_ID = ID[MSG04_INDEX].identifier ;

	ID[MSG05_INDEX].Pages.priority 		= PRIORITY_100 ;
	ID[MSG05_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG05_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG05_INDEX].Pages.messageID 	= MESSAGE05 ;
	ID[MSG05_INDEX].Pages.DA 			= SCB_NODE;
	ID[MSG05_INDEX].Pages.SA 			= BCM_NODE;
	BCM_MSG.Message05_ID = ID[MSG05_INDEX].identifier ;

	ID[MSG06_INDEX].Pages.priority 		= PRIORITY_100 ;
	ID[MSG06_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG06_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG06_INDEX].Pages.messageID 	= MESSAGE06 ;
	ID[MSG06_INDEX].Pages.DA 			= SCB_NODE;
	ID[MSG06_INDEX].Pages.SA 			= BMS_NODE;
	BMS_MSG.Message06_ID = ID[MSG06_INDEX].identifier ;

	ID[MSG07_INDEX].Pages.priority 		= PRIORITY_100 ;
	ID[MSG07_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG07_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG07_INDEX].Pages.messageID 	= MESSAGE07 ;
	ID[MSG07_INDEX].Pages.DA 			= SCB_NODE;
	ID[MSG07_INDEX].Pages.SA 			= BMS_NODE;
	BMS_MSG.Message07_ID = ID[MSG07_INDEX].identifier ;

	ID[MSG08_INDEX].Pages.priority 		= PRIORITY_100 ;
	ID[MSG08_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG08_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG08_INDEX].Pages.messageID 	= MESSAGE08 ;
	ID[MSG08_INDEX].Pages.DA 			= SCB_NODE;
	ID[MSG08_INDEX].Pages.SA 			= BMS_NODE;
	BMS_MSG.Message08_ID = ID[MSG08_INDEX].identifier ;

	ID[MSG09_INDEX].Pages.priority 		= PRIORITY_100 ;
	ID[MSG09_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG09_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG09_INDEX].Pages.messageID 	= MESSAGE09 ;
	ID[MSG09_INDEX].Pages.DA 			= SCB_NODE;
	ID[MSG09_INDEX].Pages.SA 			= BMS_NODE;
	BMS_MSG.Message09_ID = ID[MSG09_INDEX].identifier ;

	ID[MSG10_INDEX].Pages.priority 		= PRIORITY_100 ;
	ID[MSG10_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG10_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG10_INDEX].Pages.messageID 	= MESSAGE10 ;
	ID[MSG10_INDEX].Pages.DA 			= SCB_NODE;
	ID[MSG10_INDEX].Pages.SA 			= BMS_NODE;
	BMS_MSG.Message10_ID = ID[MSG10_INDEX].identifier ;

