heaven1925/EEM_Protocol/Examples/0016_stm32cu_bcm_demo/Drivers/EEMProtocol/src/EEMProtocol.c
	ID[MSG11_INDEX].Pages.priority 		= PRIORITY_001 ;
	ID[MSG11_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG11_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG11_INDEX].Pages.messageID 	= MESSAGE11 ;
	ID[MSG11_INDEX].Pages.DA 			= MS1_NODE;
	ID[MSG11_INDEX].Pages.SA 			= BCM_NODE ;
	BCM_MSG.Message11_ID = ID[MSG11_INDEX].identifier ;

	ID[MSG12_INDEX].Pages.priority 		= PRIORITY_001 ;
	ID[MSG12_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG12_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG12_INDEX].Pages.messageID 	= MESSAGE12 ;
	ID[MSG12_INDEX].Pages.DA 			= MS2_NODE;
	ID[MSG12_INDEX].Pages.SA 			= BCM_NODE ;
	BCM_MSG.Message12_ID = ID[MSG12_INDEX].identifier ;

	ID[MSG13_INDEX].Pages.priority 		= PRIORITY_001 ;
	ID[MSG13_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG13_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG13_INDEX].Pages.messageID 	= MESSAGE13 ;
	ID[MSG13_INDEX].Pages.DA 			= BCM_NODE ;
	ID[MSG13_INDEX].Pages.SA 			= MS1_NODE ;
	MS1_MSG.Message13_ID = ID[MSG13_INDEX].identifier ;

	ID[MSG14_INDEX].Pages.priority 		= PRIORITY_001 ;
	ID[MSG14_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG14_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG14_INDEX].Pages.messageID 	= MESSAGE14 ;
	ID[MSG14_INDEX].Pages.DA 			= BCM_NODE ;
	ID[MSG14_INDEX].Pages.SA 			= MS1_NODE ;
	MS1_MSG.Message14_ID = ID[MSG14_INDEX].identifier ;

	ID[MSG15_INDEX].Pages.priority 		= PRIORITY_001 ;
	ID[MSG15_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG15_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG15_INDEX].Pages.messageID 	= MESSAGE15 ;
	ID[MSG15_INDEX].Pages.DA 			= BCM_NODE ;
	ID[MSG15_INDEX].Pages.SA 			= MS1_NODE ;
	MS1_MSG.Message15_ID = ID[MSG15_INDEX].identifier ;

    ID[MSG16_INDEX].Pages.priority 		= PRIORITY_001 ;
    ID[MSG16_INDEX].Pages.reserved 		= NOT_RESERVED ;
    ID[MSG16_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
    ID[MSG16_INDEX].Pages.messageID 	= MESSAGE16 ;
    ID[MSG16_INDEX].Pages.DA 			= BCM_NODE ;
    ID[MSG16_INDEX].Pages.SA 			= MS2_NODE ;
    MS2_MSG.Message16_ID = ID[MSG16_INDEX].identifier ;

	ID[MSG17_INDEX].Pages.priority 		= PRIORITY_001 ;
	ID[MSG17_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG17_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG17_INDEX].Pages.messageID 	= MESSAGE17 ;
	ID[MSG17_INDEX].Pages.DA 			= BCM_NODE ;
	ID[MSG17_INDEX].Pages.SA 			= MS2_NODE ;
	MS2_MSG.Message17_ID = ID[MSG17_INDEX].identifier ;

	ID[MSG18_INDEX].Pages.priority 		= PRIORITY_001 ;
	ID[MSG18_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG18_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG18_INDEX].Pages.messageID 	= MESSAGE18 ;
	ID[MSG18_INDEX].Pages.DA 			= BCM_NODE ;
	ID[MSG18_INDEX].Pages.SA 			= MS2_NODE ;
	MS2_MSG.Message18_ID = ID[MSG18_INDEX].identifier ;

	ID[MSG19_INDEX].Pages.priority 		= PRIORITY_001 ;
	ID[MSG19_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG19_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG19_INDEX].Pages.messageID 	= MESSAGE19 ;
	ID[MSG19_INDEX].Pages.DA 			= BCM_NODE ;
	ID[MSG19_INDEX].Pages.SA 			= MS1_NODE ;
	BCM_MSG.Message19_ID = ID[MSG19_INDEX].identifier ;

	ID[MSG20_INDEX].Pages.priority 		= PRIORITY_001 ;
	ID[MSG20_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG20_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG20_INDEX].Pages.messageID 	= MESSAGE20 ;
	ID[MSG20_INDEX].Pages.DA 			= BCM_NODE ;
	ID[MSG20_INDEX].Pages.SA 			= MS2_NODE ;
	BCM_MSG.Message20_ID = ID[MSG20_INDEX].identifier ;

	ID[MSG21_INDEX].Pages.priority 		= PRIORITY_011 ;
	ID[MSG21_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG21_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG21_INDEX].Pages.messageID 	= MESSAGE21 ;
	ID[MSG21_INDEX].Pages.DA 			= BCM_NODE;
	ID[MSG21_INDEX].Pages.SA 			= SCB_NODE;
	SCB_MSG.Message21_ID = ID[MSG21_INDEX].identifier ;

	ID[MSG22_INDEX].Pages.priority 		= PRIORITY_111 ;
	ID[MSG22_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG22_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG22_INDEX].Pages.messageID 	= MESSAGE22 ;
	ID[MSG22_INDEX].Pages.DA 			= BCM_NODE;
	ID[MSG22_INDEX].Pages.SA 			= TLM_NODE;
	TLM_MSG.Message22_ID = 	ID[MSG22_INDEX].identifier ;

	ID[MSG23_INDEX].Pages.priority 		= PRIORITY_111 ;
	ID[MSG23_INDEX].Pages.reserved 		= NOT_RESERVED ;
	ID[MSG23_INDEX].Pages.dataPoint 	= DATAPAGE_0 ;
	ID[MSG23_INDEX].Pages.messageID 	= MESSAGE23 ;
	ID[MSG23_INDEX].Pages.DA 			= BCM_NODE;
	ID[MSG23_INDEX].Pages.SA 			= TLM_NODE;
	TLM_MSG.Message23_ID = 	ID[MSG23_INDEX].identifier ;


#if defined( BCM_MODULE )
	if( EEM_FILTER_BCM( param ) != EEM_EOK ) return EEM_ERROR;
#elif	defined( HVAC_MODULE )
	/* HVAC module has been written Cpp language in order to arduino framework */
#elif	defined( SCB_MODULE )
/* Simple computer protocol has written pyhton language */
#elif	defined( BMS_MODULE )
	if( EEM_FILTER_BMS( param ) != EEM_EOK ) return EEM_ERROR;
#elif	defined( MS1_MODULE )
	if( EEM_FILTER_MS1( param ) != EEM_EOK ) return EEM_ERROR;
#elif	defined( MS2_MODULE )
	if( EEM_FILTER_MS2( param ) != EEM_EOK ) return EEM_ERROR;
#elif	defined( ISO_MODULE )
	if( EEM_FILTER_ISO( param ) != EEM_EOK ) return EEM_ERROR;
#elif	defined( TLM_MODULE )
	if( EEM_FILTER_TLM( param ) != EEM_EOK ) return EEM_ERROR;
#else
	/* No Filter */
#endif


#if (defined(STM32F446xx) || defined(STM32F407xx) && defined(BXCAN_Protocol))





#elif (defined(STM32H750xx) && defined(FDCAN_Protocol))

	/* Configure global filter to reject all non-matching frames */
	 HAL_FDCAN_ConfigGlobalFilter(&param->fdHandle.hfdcanHandle, FDCAN_REJECT, FDCAN_REJECT, FDCAN_REJECT_REMOTE, FDCAN_REJECT_REMOTE);

	if(HAL_FDCAN_Start(&param->fdHandle.hfdcanHandle)!= HAL_OK)
	{
		return EEM_ERROR;
	}

	if (HAL_FDCAN_ActivateNotification(&param->fdHandle.hfdcanHandle, FDCAN_IT_RX_FIFO0_NEW_MESSAGE
																	   , 0) != HAL_OK)
	{
		return EEM_ERROR;
	}

	/* TEST MESSAGE FOR CAN LINE */
	/*******************************************************************************/
	FDCAN_TxHeaderTypeDef   TestTxHeader;
	EEM_U8               	TestTxData[8] = { 0xEE , EEM_VERSION , 0xEE , EEM_SUBVERSION , 0xEE , EEM_REVISION , 0xEE , 0xEE};
	TestTxHeader.Identifier 			= 0x65D;
	TestTxHeader.IdType 				= FDCAN_STANDARD_ID;
	TestTxHeader.TxFrameType 			= FDCAN_DATA_FRAME;
	TestTxHeader.DataLength 			= FDCAN_DLC_BYTES_8;
	TestTxHeader.ErrorStateIndicator 	= FDCAN_ESI_ACTIVE;
	TestTxHeader.BitRateSwitch	 		= FDCAN_BRS_OFF;
	TestTxHeader.FDFormat 				= FDCAN_CLASSIC_CAN;
	TestTxHeader.TxEventFifoControl 	= FDCAN_STORE_TX_EVENTS;
	TestTxHeader.MessageMarker 			= 0;
	if (HAL_FDCAN_AddMessageToTxFifoQ(&param->fdHandle.hfdcanHandle, &TestTxHeader, TestTxData)!= HAL_OK)
	{
		return EEM_ERROR;
	}
	/*******************************************************************************/
#else

