heaven1925/EEM_Protocol/Examples/0016_stm32cu_bcm_demo/Drivers/EEMProtocol/src/EEMProtocol.c
		 BCM_MSG.Message07.SPN.VOLTAGE_C5= (EEM_U16)((param->DATA[0])|(param->DATA[1]<<8));
		 BCM_MSG.Message07.SPN.VOLTAGE_C6= (EEM_U16)((param->DATA[1])|(param->DATA[2]<<8));
		 BCM_MSG.Message07.SPN.VOLTAGE_C7= (EEM_U16)((param->DATA[3])|(param->DATA[4]<<8));
		 BCM_MSG.Message07.SPN.VOLTAGE_C8= (EEM_U16)((param->DATA[5])|(param->DATA[6]<<8));



	break;

	case MESSAGE08 :

		 BCM_MSG.Message08.SPN.VOLTAGE_C9= (EEM_U16)((param->DATA[0])|(param->DATA[1]<<8));
		 BCM_MSG.Message08.SPN.VOLTAGE_C10= (EEM_U16)((param->DATA[1])|(param->DATA[2]<<8));
		 BCM_MSG.Message08.SPN.VOLTAGE_C11= (EEM_U16)((param->DATA[3])|(param->DATA[4]<<8));
		 BCM_MSG.Message08.SPN.VOLTAGE_C12= (EEM_U16)((param->DATA[5])|(param->DATA[6]<<8));

	break;

	case MESSAGE09 :

		 BCM_MSG.Message09.SPN.VOLTAGE_C13= (EEM_U16)((param->DATA[0])|(param->DATA[1]<<8));
		 BCM_MSG.Message09.SPN.VOLTAGE_C14= (EEM_U16)((param->DATA[1])|(param->DATA[2]<<8));
		 BCM_MSG.Message09.SPN.VOLTAGE_C15= (EEM_U16)((param->DATA[3])|(param->DATA[4]<<8));
		 BCM_MSG.Message09.SPN.VOLTAGE_C16= (EEM_U16)((param->DATA[5])|(param->DATA[6]<<8));


	break;

	case MESSAGE10 :

		BCM_MSG.Message10.SPN.VOLTAGE_C17=(EEM_U16)((param->DATA[0])|(param->DATA[1]<<8));
		BCM_MSG.Message10.SPN.VOLTAGE_C18=(EEM_U16)((param->DATA[2])|(param->DATA[3]<<8));
		BCM_MSG.Message10.SPN.TEMP=(EEM_U16)((param->DATA[4])|(param->DATA[5]<<8));
		BCM_MSG.Message10.SPN.CURRENT=(EEM_U16)((param->DATA[6])|(param->DATA[7]<<8));

	break;

	case MESSAGE11 :

		BCM_MSG.Message11.SPN.BCM_MS1_Speed=(EEM_U16)(param->DATA[0]|
				                             (EEM_U16)(param->DATA[1])<<8);

		break;

	case MESSAGE12 :

		BCM_MSG.Message12.SPN.BCM_MS2_Speed=(EEM_U16)(param->DATA[0]|
                                             (EEM_U16)(param->DATA[1])<<8);

		break;

	case MESSAGE13 :

		MS1_MSG.Message13.SPN.MS1_Mode=(EEM_U8)(param->DATA[0]);
		MS1_MSG.Message13.SPN.MS1_temperature=(EEM_U16)(param->DATA[1])|
				                       (EEM_U16)((param->DATA[2])<<8);

		MS1_MSG.Message13.SPN.MS1_warningFlag01=(EEM_BOOL_T)(param->DATA[3]&0x01);
		MS1_MSG.Message13.SPN.MS1_warningFlag02=(EEM_BOOL_T)((param->DATA[3]&0x02)>>1);
		MS1_MSG.Message13.SPN.MS1_warningFlag03=(EEM_BOOL_T)((param->DATA[3]&0x04)>>2);
		MS1_MSG.Message13.SPN.MS1_warningFlag04=(EEM_BOOL_T)((param->DATA[3]&0x08)>>3);
		MS1_MSG.Message13.SPN.MS1_warningFlag05=(EEM_BOOL_T)((param->DATA[3]&0x10)>>4);
		MS1_MSG.Message13.SPN.MS1_warningFlag06=(EEM_BOOL_T)((param->DATA[3]&0x20)>>5);
		MS1_MSG.Message13.SPN.MS1_warningFlag07=(EEM_BOOL_T)((param->DATA[3]&0x30)>>6);
		MS1_MSG.Message13.SPN.MS1_warningFlag08=(EEM_BOOL_T)((param->DATA[3]&0x40)>>7);

		MS1_MSG.Message13.SPN.MS1_errorFlag01=  (EEM_BOOL_T)(param->DATA[4]&0x01);
		MS1_MSG.Message13.SPN.MS1_errorFlag02=  (EEM_BOOL_T)((param->DATA[4]&0x02)>>1);
		MS1_MSG.Message13.SPN.MS1_errorFlag03=  (EEM_BOOL_T)((param->DATA[4]&0x04)>>2);
		MS1_MSG.Message13.SPN.MS1_errorFlag04=  (EEM_BOOL_T)((param->DATA[4]&0x08)>>3);
		MS1_MSG.Message13.SPN.MS1_errorFlag05=  (EEM_BOOL_T)((param->DATA[4]&0x10)>>4);
		MS1_MSG.Message13.SPN.MS1_errorFlag06=  (EEM_BOOL_T)((param->DATA[4]&0x20)>>5);
		MS1_MSG.Message13.SPN.MS1_errorFlag07=  (EEM_BOOL_T)((param->DATA[4]&0x40)>>6);
		MS1_MSG.Message13.SPN.MS1_errorFlag08=  (EEM_BOOL_T)((param->DATA[4]&0x80)>>7);

		MS1_MSG.Message13.SPN.MS1_statusBit01 =  (EEM_BOOL_T)(param->DATA[5]&0x01);
		MS1_MSG.Message13.SPN.MS1_statusBit02 =  (EEM_BOOL_T)((param->DATA[5]&0x02)>>1);
		MS1_MSG.Message13.SPN.MS1_statusBit03 =  (EEM_BOOL_T)((param->DATA[5]&0x04)>>2);
		MS1_MSG.Message13.SPN.MS1_statusBit04 =  (EEM_BOOL_T)((param->DATA[5]&0x08)>>3);
		MS1_MSG.Message13.SPN.MS1_statusBit05 =  (EEM_BOOL_T)((param->DATA[5]&0x10)>>4);
		MS1_MSG.Message13.SPN.MS1_statusBit06 =  (EEM_BOOL_T)((param->DATA[5]&0x20)>>5);
		MS1_MSG.Message13.SPN.MS1_statusBit07 =  (EEM_BOOL_T)((param->DATA[5]&0x40)>>6);
        MS1_MSG.Message13.SPN.MS1_statusBit08 =  (EEM_BOOL_T)((param->DATA[5]&0x80)>>7);


		break;

	case MESSAGE14 :
		MS1_MSG.Message14.SPN.MS1_voltage        = (EEM_U16)(param->DATA[0])|
		                                 (EEM_U16)(param->DATA[1]<<8);

		MS1_MSG.Message14.SPN.MS1_PhaseUCurrent  = (EEM_U16)(param->DATA[1])|
	                                   (EEM_U16)(param->DATA[2]<<8);

		MS1_MSG.Message14.SPN.MS1_PhaseVCurrent  = (EEM_U16)((param->DATA[3])|
		                                   (EEM_U16)(param->DATA[4]<<8));

		MS1_MSG.Message14.SPN.MS1_PhaseWCurrent  = (EEM_U16)((param->DATA[5])|
				                                   (EEM_U16)(param->DATA[6]<<8));

		break;
	case MESSAGE15 :

		MS1_MSG.Message15.SPN.MS1_SpeedVal=
				(EEM_U64)( ((EEM_U64)param->DATA[0] 	  )	|
						   ((EEM_U64)param->DATA[1] << 8  )	|
						   ((EEM_U64)param->DATA[2] << 16 ) |
						   ((EEM_U64)param->DATA[3] << 24 ) |
						   ((EEM_U64)param->DATA[4] << 32 ) |
						   ((EEM_U64)param->DATA[5] << 40 ) |
						   ((EEM_U64)param->DATA[6] << 48 ) |
						   ((EEM_U64)param->DATA[7] << 56 ) );


		break;


	case MESSAGE16 :
		MS2_MSG.Message16.SPN.MS2_Mode		=(EEM_U8)(param->DATA[0]);
		MS2_MSG.Message16.SPN.MS2_temperature=(EEM_U16)(param->DATA[1])|(EEM_U16)((param->DATA[2])<<8);

		MS2_MSG.Message16.SPN.MS2_warningFlag01=(EEM_BOOL_T)(param->DATA[3]&0x01);
		MS2_MSG.Message16.SPN.MS2_warningFlag02=(EEM_BOOL_T)((param->DATA[3]&0x02)>>1);
		MS2_MSG.Message16.SPN.MS2_warningFlag03=(EEM_BOOL_T)((param->DATA[3]&0x04)>>2);
		MS2_MSG.Message16.SPN.MS2_warningFlag04=(EEM_BOOL_T)((param->DATA[3]&0x08)>>3);
		MS2_MSG.Message16.SPN.MS2_warningFlag05=(EEM_BOOL_T)((param->DATA[3]&0x10)>>4);
		MS2_MSG.Message16.SPN.MS2_warningFlag06=(EEM_BOOL_T)((param->DATA[3]&0x20)>>5);
		MS2_MSG.Message16.SPN.MS2_warningFlag07=(EEM_BOOL_T)((param->DATA[3]&0x30)>>6);
		MS2_MSG.Message16.SPN.MS2_warningFlag08=(EEM_BOOL_T)((param->DATA[3]&0x40)>>7);

		MS2_MSG.Message16.SPN.MS2_errorFlag01=  (EEM_BOOL_T)(param->DATA[4]&0x01);
		MS2_MSG.Message16.SPN.MS2_errorFlag02=  (EEM_BOOL_T)((param->DATA[4]&0x02)>>1);
		MS2_MSG.Message16.SPN.MS2_errorFlag03=  (EEM_BOOL_T)((param->DATA[4]&0x04)>>2);
		MS2_MSG.Message16.SPN.MS2_errorFlag04=  (EEM_BOOL_T)((param->DATA[4]&0x08)>>3);
		MS2_MSG.Message16.SPN.MS2_errorFlag05=  (EEM_BOOL_T)((param->DATA[4]&0x10)>>4);
		MS2_MSG.Message16.SPN.MS2_errorFlag06=  (EEM_BOOL_T)((param->DATA[4]&0x20)>>5);
		MS2_MSG.Message16.SPN.MS2_errorFlag07=  (EEM_BOOL_T)((param->DATA[4]&0x40)>>6);
		MS2_MSG.Message16.SPN.MS2_errorFlag08=  (EEM_BOOL_T)((param->DATA[4]&0x80)>>7);

